РасчетныеЗадачиЗанятие5/src/Documents/ПремияРуководителюПодразделения/ПремияРуководителюПодразделения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПремияРуководителюПодразделения</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСРаботниками</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПремии</name>
    <type>
      <types>DefinedType.ПоложительноеЧисло</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.Начисления</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.Начисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиРасчетаЗарплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>DefinedType.ПоложительноеЧисло</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ВидыГрафиковРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>DefinedType.ДенежнаяСумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноДней</name>
      <type>
        <types>DefinedType.КоличествоВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>Сторно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РасчетныеЗадачиЗанятие5/src/Documents/ПремияРуководителюПодразделения/Forms/ФормаДокумента1/Module.bsl
&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыДокументаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыДокументаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РуководителиПодразделенийСрезПоследних.Подразделение,
	|	РуководителиПодразделенийСрезПоследних.Руководитель,
	|	РуководителиПодразделенийСрезПоследних.РазмерПремии
	|ПОМЕСТИТЬ ВТРуководитель
	|ИЗ
	|	РегистрСведений.РуководителиПодразделений.СрезПоследних(&НачалоМесяца, Подразделение = &Подразделение) КАК
	|		РуководителиПодразделенийСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСрезПоследних.Подразделение,
	|	СотрудникиСрезПоследних.ФизическоеЛицо,
	|	СотрудникиСрезПоследних.Должность,
	|	ВТРуководитель.РазмерПремии,
	|	СотрудникиСрезПоследних.ГрафикРаботы
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(&НачалоМесяца, (ФизическоеЛицо, Подразделение) В
	|		(ВЫБРАТЬ
	|			ВТРуководитель.Руководитель,
	|			ВТРуководитель.Подразделение
	|		ИЗ
	|			ВТРуководитель КАК ВТРуководитель)) КАК СотрудникиСрезПоследних,
	|	ВТРуководитель КАК ВТРуководитель";
	
	Запрос.УстановитьПараметр("НачалоМесяца", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Объект.ФизическоеЛицо = Выборка.ФизическоеЛицо;
		Объект.Должность = Выборка.Должность;
		Объект.ГрафикРаботы = Выборка.ГрафикРаботы;
		Объект.РазмерПремии = Выборка.РазмерПремии;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодРегистрацииПриИзменении(Элемент)
	
	Объект.ПериодРегистрации = НачалоМесяца(Объект.ПериодРегистрации);
	
	ЗаполнитьРеквизитыДокументаНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьРесурсы(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
		
		ПоказатьПредупреждение(,"Для расчета документ надо записать!",15,"Это новый документ!");
		
		Возврат;
		
	КонецЕсли;
	
	
	Если Объект.Проведен = Истина Тогда
	
		ПоказатьВопрос(
		Новый ОписаниеОповещения("РассчитатьРесурсыЗавершение", ЭтотОбъект)
		,"Рассчитывать можно только НЕПРОВЕДЕННЫЙ документ. Отменить проведение?",
		РежимДиалогаВопрос.ДаНет,
		30, КодВозвратаДиалога.Да,"Внимание! Документ проведен.", КодВозвратаДиалога.Да);
		
		Возврат;
	
	КонецЕсли;
	
	РассчитатьРесурсыНаСервере();
	
	ТекущийЭлемент = Элементы.СтраницаНачисления;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРесурсыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
		
		РассчитатьРесурсыНаСервере();
		
		ТекущийЭлемент = Элементы.СтраницаНачисления;
	
	КонецЕсли;
	
	

КонецПроцедуры // РассчитатьРесурсыЗавершение()

&НаСервере
Процедура РассчитатьРесурсыНаСервере()
	
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.РассчитатьРесурсы(); //Вызов экспортной процедуры объекта
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	
КонецПроцедуры
